# AtomViolationWhenMultiPlacedInstances Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..AtomViolationWhenMultiPlacedInstances Property
BuiltInFailures..::..GroupFailures Class See Also
---
Changes to groups are allowed only in group edit mode. Use the Edit Group command to change to all instances of a group type. You may use the "Ungroup" option to proceed with this change by ungrouping the changed group instances.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AtomViolationWhenMultiPlacedInstances { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AtomViolationWhenMultiPlacedInstances As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AtomViolationWhenMultiPlacedInstances {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace